Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The negotiated key (Z) is used as the pre_master_secret, and is converted into the master_secret, as specified above.
zh_cn: 经协商的密钥(Z)用作 pre_master_secret，并且被转换成 master_secret，如上规定。

source: The new `safeSubscribe` method was introduced to explicitly add the safety wrapper around a consumer type.
zh_cn: 引入了新的 `safeSubscribe` 方法，以明确地在消费者类型周围添加安全包装。

source: The new design allows easier analysis by cryptographers due to their improved key separation properties.
zh_cn: 新的设计允许加密人员更容易地分析，因为他们改进了密钥分离特性。

source: The new interface is **constrained to RxJava 2** and represents a consumer to `Flowable` that is able to work in a mode that relaxes the Reactive-Streams version 1.0.0 specification in rules §1.3, §2.3, §2.12 and §3.9:
zh_cn: 新接口被 **约束为 RxJava 2** 并且将消费者表示为 `Flowable`，它能够在 Reactive-Streams 版本 1.0.0 规范的规则 §1.3，§2.3，§2.12 和 §3.9 的宽松模式中工作：

source: The newly introduced EncryptedExtensions message allows various extensions previously sent in the clear in the ServerHello to also enjoy confidentiality protection.
zh_cn: 新引入的 EncryptedExtensions 消息允许以前在 ServerHello 中以明文形式发送的各种扩展也享有机密性保护。

source: The next generation of traffic keys is computed by generating client_/server_application_traffic_secret_N+1 from client_/server_application_traffic_secret_N as described in this section and then re-deriving the traffic keys as described in Section 7.3.
zh_cn: 下一代通信密钥的计算方法是，如本节所述，从 client_/server_application_traffic_secret_N 生成 client_/server_application_traffic_secret_N + 1，然后按第 7.3 节所述重新导出通信密钥。

source: The next two messages from the server, EncryptedExtensions and CertificateRequest, contain information from the server that determines the rest of the handshake.
zh_cn: 来自服务器的下两条消息 EncryptedExtensions 和 CertificateRequest 包含来自服务器的信息，用于确定握手的其余部分。

source: The next-generation application_traffic_secret is computed as:
zh_cn: 下一代 application_traffic_secret 计算如下：

source: The no argument `Action0` is replaced by the `io.reactivex.functions.Action` for the operators and `java.lang.Runnable` for the `Scheduler` methods.
zh_cn: 无参数 `Action0` 被替换为用于运算符的 `io.reactivex.functions.Action` 和用于 `Scheduler` 方法的 `java.lang.Runnable`。

source: The normal procedure for parsing an HTTP message is to read the start-line into a structure, read each header field into a hash table by field name until the empty line, and then use the parsed data to determine if a message body is expected.
zh_cn: 解析 HTTP 消息的正常过程是将起始行读入结构，按字段名称将每个首部字段读取到散列表中直到空行，然后使用解析的数据来确定是否需要消息体。

source: The normal state for the data transfer phase of the connection.
zh_cn: 连接的数据传输阶段的正常状态。

source: The number of 32 bit words in the TCP Header.
zh_cn: TCP 首部中 32 位字的数量。

source: The number of data octets beginning with the one indicated in the acknowledgment field which the sender of this segment is willing to accept.
zh_cn: 该报文段的发送方愿意接受的数据八位字节数，从确认字段中指示的数据八位字节数开始。

source: The numerical value can describe a range over which the same name applies.
zh_cn: 数值可以描述相同名称适用的范围。

source: The official Javadoc pages for 2.x is hosted at http://reactivex.io/RxJava/2.x/javadoc/
zh_cn: 2.x 的官方 Javadoc 页面托管在 http://reactivex.io/RxJava/2.x/javadoc/

source: The one exception is the "multipart/byteranges" type (appendix 19.2) when it appears in a 206 (Partial Content) response, which will be interpreted by some HTTP caching mechanisms as described in sections 13.5.4 and 14.16.
zh_cn: 当它出现在 206(部分内容)响应中时，一个例外是“multipart/byteranges”类型(附录 19.2)，它将由 13.5.4 和 14.16 节中描述的某些 HTTP 缓存机制解释。

source: The one message that is not bound by these ordering rules is the HelloRequest message, which can be sent at any time, but which SHOULD be ignored by the client if it arrives in the middle of a handshake.
zh_cn: 不受这些排序规则约束的一条消息是 HelloRequest 消息，可以随时发送，但如果它在客户端握手过程中到达，则应该被客户端忽略。

source: The only dependency between the `sourceObservable` and the `someSingleSource` is that the former should complete normally in order for the latter to be consumed.
zh_cn: `sourceObservable` 和 `someSingleSource` 之间唯一的依赖关系是前者应该正常完成，以便后者被消耗。

source: The only difference between them is the direction in which the data flows.
zh_cn: 它们之间的唯一区别是数据流动的方向。

source: The only range unit defined by HTTP/1.1 is "bytes".
zh_cn: HTTP/1.1 定义的唯一范围单位是“bytes”。

source: The opaque value contains the Diffie-Hellman public value (Y = g^X mod p) for the specified group (see [RFC7919] for group definitions) encoded as a big-endian integer and padded to the left with zeros to the size of p in bytes.
zh_cn: opaque 值包含指定组的 Diffie-Hellman 公共值(Y = g ^ X mod p)(参见 [RFC7919] 的组定义)，编码为大端整数，并用 0 填充到左边，以字节为单位的 p 大小。

source: The operator `flatMap` does this by first mapping each number from 1 to 10 into its own individual `Flowable`, runs them and merges the computed squares.
zh_cn: 运算符 `flatMap` 通过首先将 1 到 10 中的每个数字映射到它自己的 `Flowable` 中，运行它们并合并计算出的平方。

source: The operator `range` sends a callback, in the form of an implementation of the `org.reactivestreams.Subscription` interface, to the `observeOn` by calling its (inner `Subscriber`'s) `onSubscribe`.
zh_cn: 操作符 `range` 以 `org.reactivestreams.Subscription` 接口的实现形式，通过调用其(内部 `Subscriber` 的) `onSubscribe` 向 `observeOn` 发送一个回调。

source: The option-length counts the two octets of option-kind and option-length as well as the option-data octets.
zh_cn: option-length 计算 option-kind 和 option-length 的两个八位字节以及 option-data 八位字节。

source: The optional fragment component allows for indirect identification of a secondary resource, independent of the URI scheme, as defined in Section 3.5 of [RFC3986].
zh_cn: 可选的 fragment 组件允许间接识别辅助资源，独立于 URI 方案，如 [RFC3986] 的第 3.5 节中所定义。

source: The order in which header fields with differing field names are received is not significant.
zh_cn: 接收到具有不同字段名称的首部字段的顺序并不重要。

source: The order in which header fields with the same field name are received is therefore significant to the interpretation of the combined field value; a proxy MUST NOT change the order of these field values when forwarding a message.
zh_cn: 因此，接收具有相同字段名称的首部字段的顺序对于组合字段值的解释是重要的；代理不得在转发消息时更改这些字段值的顺序。

source: The order in which header fields with the same field-name are received is therefore significant to the interpretation of the combined field value, and thus a proxy MUST NOT change the order of these field values when a message is forwarded.
zh_cn: 因此，接收具有相同字段名称的首部字段的顺序对于组合字段值的解释是重要的，因此代理不能在转发消息时改变这些字段值的顺序。

source: The origin server MUST NOT wait for the request body before sending the 100 (Continue) response.
zh_cn: 在发送 100(继续)响应之前，源服务器不得等待请求主体。

source: The origin server for an "http" URI is identified by the authority component, which includes a host identifier and optional TCP port ([RFC3986], Section 3.2.2).
zh_cn: “http”URI 的原始服务器由 authority 组件标识，该组件包括主机标识符和可选的 TCP 端口([RFC3986]，第 3.2.2 节)。

source: The original `Subscription` container types have been renamed and updated
zh_cn: 原始的 `Subscription` 容器类型已重命名和更新

source: The other `XProcessor` types honor backpressure of their downstream subscribers but otherwise, when subscribed to a source (optional), they consume it in an unbounded manner (requesting `Long.MAX_VALUE`).
zh_cn: 其他 `XProcessor` 类型支持其下游订阅者的背压，但是当订阅源(可选)时，它们以无限制的方式消费它(请求 `Long.MAX_VALUE`)。

source: The other base reactive types also follow this signature with their respective subscriber types.
zh_cn: 其他基本响应类型也遵循此签名及其各自的订阅者类型。

source: The other base reactive types have similar `create` methods (minus the backpressure strategy).
zh_cn: 其他基础响应类型具有类似的 `create` 方法(减去背压策略)。

source: The other overloads of `subscribe` now return `Disposable` in 2.x.
zh_cn: `subscribe` 的其他重载现在在 2.x 中返回 `Disposable`。

source: The other party MUST respond with a close_notify alert of its own and close down the connection immediately, discarding any pending writes.
zh_cn: 另一方必须使用自己的 close_notify 警报进行响应并立即关闭连接，丢弃任何挂起的写入。

source: The other types, `Single`, `Maybe` and `Completable` don't support backpressure nor should they; there is always room to store one item temporarily.
zh_cn: 其他类型，`Single`，`Maybe`和`Completable`不支持背压，也不应该支持背压；它们只是暂时存放单个项目的空间。

source: The output is either the plaintext or an error indicating that the decryption failed.
zh_cn: 输出是明文或表示解密失败的错误。

source: The pad is not transmitted as part of the segment.
zh_cn: 填充不作为报文段的传输部分。

source: The padding MAY be any length up to 255 bytes, as long as it results in the TLSCiphertext.length being an integral multiple of the block length.
zh_cn: 填充可以是任何长度，最多 255 个字节，只要它导致 TLSCiphertext.length 是块长度的整数倍。

source: The padding is composed of zeros.
zh_cn: 填充由零组成。

source: The padding length MUST be such that the total size of the GenericBlockCipher structure is a multiple of the cipher's block length.
zh_cn: 填充长度必须使得 GenericBlockCipher 结构的总大小是加密块长度的倍数。

source: The padding length can be 6, 14, 22, and so on, through 254.
zh_cn: 填充长度可以是 6,14,22 等，直到 254。

source: The pairs are encoded in two octets, so SignatureScheme values have been allocated to align with TLS 1.2's encoding.
zh_cn: 这些对以两个八位字节编码，因此已分配 SignatureScheme 值以与 TLS 1.2 的编码对齐。

source: The parameters for the 0-RTT data (version, symmetric cipher suite, Application-Layer Protocol Negotiation (ALPN) [RFC7301] protocol, etc.) are those associated with the PSK in use.
zh_cn: 0-RTT 数据(版本，对称密码套件，应用层协议协商(ALPN)[RFC7301] 协议等)的参数是与使用中的 PSK 相关联的参数。

source: The partial GET method is intended to reduce unnecessary network usage by allowing partially-retrieved entities to be completed without transferring data already held by the client.
zh_cn: 部分 GET 方法旨在通过允许完成部分检索的实体而不传输客户端已经拥有的数据来减少不必要的网络使用。

source: The passing of authentication information in clear text has proven to be a security risk in almost every case where it has been used.
zh_cn: 以明文形式传递身份验证信息几乎在所有使用过的情况下都被证明是一种安全风险。

source: The path component contains data, usually organized in hierarchical form, that, along with data in the non-hierarchical query component (Section 3.4), serves to identify a resource within the scope of the URI's scheme and naming authority (if any).
zh_cn: 路径组件包含通常以分层形式组织的数据，该数据与非分层查询组件(第 3.4 节)中的数据一起用于标识 URI 方案和命名权限(如果有)范围内的资源。

source: The path is terminated by the first question mark ("?") or number sign ("#") character, or by the end of the URI.
zh_cn: 路径由第一个问号(“?”)或数字符号(“#”)字符终止，或者由 URI 的末尾终止。

source: The path segments "." and "..", also known as dot-segments, are defined for relative reference within the path name hierarchy.
zh_cn: 路径段“.”和“..”，也称为点段，被定义为路径名称层次结构内的相对引用。

source: The plaintext input to the AEAD algorithm is the encoded TLSInnerPlaintext structure.
zh_cn: 输入 AEAD 算法的明文是编码的 TLSInnerPlaintext 结构。

source: The plaintext is the TLSCompressed.fragment.
zh_cn: 明文是 TLSCompressed.fragment。

source: The port subcomponent of authority is designated by an optional port number in decimal following the host and delimited from it by a single colon (":") character.
zh_cn: 权限的端口子组件由主机后面的十进制可选端口号指定，并由单个冒号(“:”)字符分隔。

source: The posted entity is subordinate to that URI in the same way that a file is subordinate to a directory containing it, a news article is subordinate to a newsgroup to which it is posted, or a record is subordinate to a database.
zh_cn: 发布的实体从属于该 URI，其方式与文件从属于包含它的目录相同，新闻文章从属于发布它的新闻组，或者记录从属于数据库。

source: The pre_master_secret should be deleted from memory once the master_secret has been computed.
zh_cn: 该 pre_master_secret 应该从内存中删除，一旦 master_secret 已经计算出。

source: The preparation of dataflows by applying various intermediate operators happens in the so-called **assembly time**:
zh_cn: 通过应用各种中间运算符来准备数据流发生在所谓的 **assembly time** 中：

source: The presence of a host subcomponent within a URI does not imply that the scheme requires access to the given host on the Internet.
zh_cn: URI 中的主机子组件的存在并不意味着该方案需要访问互联网上的给定主机。

source: The presence of a message body in a request is signaled by a Content-Length or Transfer-Encoding header field.
zh_cn: 请求中存在消息主体由 Content-Length 或 Transfer-Encoding 首部字段指示。

source: The presence of a message body in a response depends on both the request method to which it is responding and the response status code (Section 3.1.2).
zh_cn: 响应中存在消息主体取决于它响应的请求方法和响应状态代码(第 3.1.2 节)。

source: The presence of a message-body in a request is signaled by the inclusion of a Content-Length or Transfer-Encoding header field in the request's message-headers.
zh_cn: 在请求的消息首部中包含 Content-Length 或 Transfer-Encoding 首部字段，可以指示请求中存在消息主体。

source: The presence of extensions can be detected by determining whether there are bytes following the compression_method field at the end of the ServerHello.
zh_cn: 可以通过确定 ServerHello 末尾的 compression_method 字段后面是否有字节来检测扩展的存在。

source: The presence of extensions can be detected by determining whether there are bytes following the compression_methods at the end of the ClientHello.
zh_cn: 可以通过确定 ClientHello 末尾的 compression_methods 之后是否存在字节来检测扩展的存在。

source: The presence of extensions can be detected by determining whether there are bytes following the compression_methods field at the end of the ClientHello.
zh_cn: 可以通过确定 ClientHello 末尾的 compression_methods 字段后面是否有字节来检测扩展的存在。

source: The presence of such whitespace in a request might be an attempt to trick a server into ignoring that field or processing the line after it as a new request, either of which might result in a security vulnerability if other implementations within the request chain interpret the same message differently.
zh_cn: 请求中存在这样的空格可能是试图欺骗服务器忽略该字段或将其后的行作为新请求处理，如果请求链中的其他实现未相同地解释消息，则可能导致安全漏洞。

source: The presence or absence of a parameter might be significant to the processing of a media-type, depending on its definition within the media type registry.
zh_cn: 参数的存在或不存在对于媒体类型的处理可能是重要的，这取决于媒体类型注册表中的定义。

source: The primary goal of TLS is to provide a secure channel between two communicating peers; the only requirement from the underlying transport is a reliable, in-order data stream.
zh_cn: TLS 的主要目标是在两个通信对等体之间提供安全通道；底层传输的唯一要求是可靠的有序数据流。

source: The primary goal of the TLS protocol is to provide privacy and data integrity between two communicating applications.
zh_cn: TLS 协议的主要目标是在两个通信应用程序之间提供隐私和数据完整性。

source: The prime modulus used for the Diffie-Hellman operation.
zh_cn: 用于 Diffie-Hellman 操作的初模数。

source: The principle reason for the three-way handshake is to prevent old duplicate connection initiations from causing confusion.
zh_cn: 三次握手的主要原因是防止旧的重复连接启动引起混淆。

source: The problem comes when one does some initialization in `onSubscribe`/`onStart` after calling `request` there and `onNext` may or may not see the effects of the initialization.
zh_cn: 在调用 `request` 之后在 `onSubscribe`/`onStart` 中进行初始化时会出现问题，因为 `onNext` 可能看到或可能看不到初始化的影响。

source: The problem is that the recovering host may not know for how long it crashed nor does it know whether there are still old duplicates in the system from earlier connection incarnations.
zh_cn: 问题是恢复的主机可能不知道它崩溃了多长时间，也不知道系统中是否还存在来自早期连接化身的旧重复。

source: The problem starts when there are, for example, 1 billion elements or the same 1 million sequence appears 1000 times in a program, leading to `OutOfMemoryError` and generally slowdowns due to excessive GC overhead.
zh_cn: 例如，当一个程序中有 10 亿个元素或相同的 100 万个序列出现 1000 次时会出现这个问题，导致 `OutOfMemoryError`，并且通常由于过多的 GC 开销而导致变慢。

source: The problem that arises from this is
zh_cn: 由此产生的问题是

source: The procedure also works if two TCP simultaneously initiate the procedure.
zh_cn: 如果两个 TCP 同时启动该过程，则该过程也有效。

source: The process for authoritative access to an "https" identified resource is defined in [RFC2818].
zh_cn: 在 [RFC2818] 中定义了对“https”标识资源进行权威访问的过程。

source: The process for registration of new URI schemes is defined separately by [BCP35].
zh_cn: 注册新 URI 方案的过程由 [BCP35] 单独定义。

source: The protocol allows client/server applications to communicate in a way that is designed to prevent eavesdropping, tampering, or message forgery.
zh_cn: 该协议允许客户端/服务器应用程序以旨在防止窃听，篡改或消息伪造的方式进行通信。

source: The protocol consists of a single message, which is encrypted and compressed under the current (not the pending) connection state.
zh_cn: 该协议由单个消息组成，在当前(而不是挂起)连接状态下对其进行加密和压缩。

source: The protocol has been designed to minimize this risk, but there are still attacks available: for example, an attacker could block access to the port a secure service runs on, or attempt to get the peers to negotiate an unauthenticated connection.
zh_cn: 该协议旨在最大限度地降低此风险，但仍然存在可用的攻击：例如，攻击者可以阻止对运行安全服务的端口的访问，或者尝试让对等端协商未经身份验证的连接。

source: The protocol is composed of two layers: the TLS Record Protocol and the TLS Handshake Protocol.
zh_cn: 该协议由两层组成：TLS 记录协议和 TLS 握手协议。

source: The protocol places no restriction on a particular connection being used over and over again.
zh_cn: 该协议对一次又一次使用的特定连接没有限制。

source: The protocol version as a whole indicates the sender's conformance with the set of requirements laid out in that version's corresponding specification of HTTP.
zh_cn: 协议版本作为一个整体表示发送者与该版本的相应 HTTP 规范中规定的一组要求的一致性。

source: The protocol version the client has attempted to negotiate is recognized but not supported.
zh_cn: 客户端尝试协商的协议版本已被识别但不受支持。

source: The protocol versioning policy is intended to allow the sender to indicate the format of a message and its capacity for understanding further HTTP communication, rather than the features obtained via that communication.
zh_cn: 协议版本控制策略旨在允许发送方指示消息的格式及其理解进一步 HTTP 通信的能力，而不是通过该通信获得的功能。

source: The proxy is requested to either service that request from a valid cache, if possible, or make the same request on the client's behalf to either the next inbound proxy server or directly to the origin server indicated by the request-target.
zh_cn: 如果可能，请求代理从有效缓存服务该请求，或者代表客户端向下一个入站代理服务器或直接向请求目标指示的源服务器发出相同的请求。

source: The proxy is requested to forward the request or service it from a valid cache, and return the response.
zh_cn: 请求的代理转发请求或从有效缓存中为其提供服务，并返回响应。

source: The proxy server MUST signal persistent connections separately with its clients and the origin servers (or other proxy servers) that it connects to.
zh_cn: 代理服务器必须分别与其客户端和它连接的源服务器(或其他代理服务器)发信号通知持久连接。

source: The proxy/gateway's response to that request MUST be in the same major version as the request.
zh_cn: 代理/网关对该请求的响应必须与请求处于相同的主要版本中。

source: The purpose is a combination of request semantics, which are defined in [RFC7231], and a target resource upon which to apply those semantics.
zh_cn: 目的是在 [RFC7231] 中定义的请求语义和应用这些语义的目标资源的组合。

source: The purpose of a payload in a request is defined by the method semantics.
zh_cn: 请求中的有效载荷的目的由方法语义定义。

source: The purpose of distinguishing between safe and unsafe methods is to allow automated retrieval processes (spiders) and cache performance optimization (pre-fetching) to work without fear of causing harm.
zh_cn: 区分安全和不安全方法的目的是允许自动检索过程(蜘蛛)和缓存性能优化(预取)工作而不用担心造成伤害。

source: The purpose of reserved characters is to provide a set of delimiting characters that are distinguishable from other data within a URI.
zh_cn: 保留字符的目的是提供一组可与 URI 中的其他数据区分开的分隔字符。

source: The purpose of the 100 (Continue) status (see section 10.1.1) is to allow a client that is sending a request message with a request body to determine if the origin server is willing to accept the request (based on the request headers) before the client sends the request body.
zh_cn: 100(继续)状态(参见第 10.1.1 节)的目的是允许正在向请求主体发送请求消息的客户端确定源服务器是否愿意接受请求(基于请求首部)在客户端发送请求主体之前。

source: The purpose of this presentation language is to document TLS only; it has no general application beyond that particular goal.
zh_cn: 此演示语言的目的仅是记录 TLS;它没有超出该特定目标的一般应用。

source: The query component contains non-hierarchical data that, along with data in the path component (Section 3.3), serves to identify a resource within the scope of the URI's scheme and naming authority (if any).
zh_cn: 查询组件包含非分层数据，与路径组件(第 3.3 节)中的数据一起用于标识 URI 方案和命名权限(如果有)范围内的资源。

source: The query component is indicated by the first question mark ("?") character and terminated by a number sign ("#") character or by the end of the URI.
zh_cn: 查询组件由第一个问号(“?”)字符表示，并以数字符号(“#”)字符或 URI 的末尾结束。

source: The quoted-pair rule no longer allows escaping control characters other than HTAB.
zh_cn: 引用对规则不再允许转义除 HTAB 之外的控制字符。

source: The real power comes with the “reactive extensions” (hence “ReactiveX”) — operators that allow you to transform, combine, manipulate, and work with the sequences of items emitted by Observables.
zh_cn: “响应式扩展 (reactive extensions)”(这也是为什么称之为 “ReactiveX”) 真正强大的地方是 - 允许您转换，组合，操作和处理 Observable 发射的项目序列的操作符。

source: The reason for this construction is to allow the server to do a stateless HelloRetryRequest by storing just the hash of ClientHello1 in the cookie, rather than requiring it to export the entire intermediate hash state (see Section 4.2.2).
zh_cn: 这种结构的原因是允许服务器通过在 cookie 中仅存储 ClientHello1 的哈希来执行无状态 HelloRetryRequest，而不是要求它导出整个中间哈希状态(参见第 4.2.2 节)。

source: The reason for this is that many source operators can "generate" values on demand and thus the operator `observeOn` can tell the `range` generate at most so many values the `observeOn` buffer can hold at once without overflow.
zh_cn: 原因是许多源操作符可以按需“生成”值，因此操作符 `observeOn` 可以告诉 `range`，最多生成 `observeOn` 缓冲区可以立即保存而不会溢出的值。

source: The reason for this is that when the library is compiled with Java 8, the javac often can't disambiguate between functional interface types.
zh_cn: 原因是当使用 Java 8 编译库时，javac 通常无法消除函数接口类型之间的歧义。

source: The reason phrases listed here are only recommendations -- they MAY be replaced by local equivalents without affecting the protocol.
zh_cn: 这里列出的短语只是建议 - 它们可以被本地等价物替换，而不会影响协议。

source: The reason phrases listed here are only recommendations -- they can be replaced by local equivalents without affecting the protocol.
zh_cn: 此处列出的原因仅是建议 - 它们可以由本地等效项替换，而不会影响协议。

source: The reason these operators have a suffix instead of simply having the same name with different signature is type erasure.
zh_cn: 这些运算符具有后缀而不是简单地具有不同签名的相同名称的原因是类型擦除。

source: The reason-phrase element exists for the sole purpose of providing a textual description associated with the numeric status code, mostly out of deference to earlier Internet application protocols that were more frequently used with interactive text clients.
zh_cn: 原因 - 短语元素的唯一目的是提供与数字状态代码相关联的文本描述，主要是出于对交互式文本客户端更频繁使用的早期互联网应用程序协议的尊重。

source: The receive window is the portion of the sequence space labeled 2 in figure 5.
zh_cn: 接收窗口是图 5 中标记为 2 的序列空间的一部分。

source: The receiver MUST check this padding and MUST use the bad_record_mac alert to indicate padding errors.
zh_cn: 接收方必须检查此填充并且必须使用 bad_record_mac 警报来指示填充错误。

source: The receiver of a CertificateVerify message MUST verify the signature field.
zh_cn: CertificateVerify 消息的接收者必须验证签名字段。

source: The receiver of a RST first validates it, then changes state.
zh_cn: RST 的接收者首先验证它，然后改变状态。

source: The receiver of the first SYN has no way of knowing whether the segment was an old delayed one or not, unless it remembers the last sequence number used on the connection (which is not always possible), and so it must ask the sender to verify this SYN.
zh_cn: 第一个 SYN 的接收者无法知道该报文段是否是旧的延迟报文段，除非它记住连接上使用的最后一个序列号(这并不总是可能)，因此它必须要求发送方验证这个 SYN。

source: The recipient of the entity MUST NOT ignore any Content-* (e.g. Content-Range) headers that it does not understand or implement and MUST return a 501 (Not Implemented) response in such cases.
zh_cn: 实体的接收者绝不能忽略它不理解或未实现的任何 Content-*(例如 Content-Range)首部，并且在这种情况下必须返回 501(Not Implemented)响应。

source: The recipient proxy can establish a tunnel either by directly connecting to the request-target or, if configured to use another proxy, by forwarding the CONNECT request to the next inbound proxy.
zh_cn: 接收者代理可以通过直接连接到请求目标来建立隧道，或者，如果配置为使用另一个代理，则通过将 CONNECT 请求转发到下一个入站代理来建立隧道。

source: The record layer fragments information blocks into TLSPlaintext records carrying data in chunks of 2^14 bytes or less.
zh_cn: 记录层将信息块分段为携带 2^14 字节或更少字节块的数据的 TLSPlaintext 记录。

source: The record layer will use the security parameters to generate the following six items (some of which are not required by all ciphers, and are thus empty):
zh_cn: 记录层将使用安全参数生成以下六个项目(其中一些项目并非所有密码都需要，因此为空)：
